app/controllers/long_to_short_urls_controller.rb

  def show
    @long_to_short_url = LongToShortUrl.find_by(id: params[:id])
    if @long_to_short_url
      visitors =  @long_to_short_url.visitors.find_by(ip_address: request.remote_ip)
      if visitors.nil?
        @long_to_short_url.visitors.create(ip_address: request.remote_ip) # track IP address
      else
        visitors.update(counter: visitors.counter+1)
---
SELECT "long_to_short_urls".* FROM "long_to_short_urls" WHERE "long_to_short_urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."long_to_short_url_id" = $1 AND "visitors"."ip_address" = $2 LIMIT $3  [["long_to_short_url_id", 1], ["ip_address", "127.0.0.1"], ["LIMIT", 1]]
INSERT INTO "visitors" ("long_to_short_url_id", "ip_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["long_to_short_url_id", 1], ["ip_address", "127.0.0.1"], ["created_at", "2023-05-02 16:15:48.916760"], ["updated_at", "2023-05-02 16:15:48.916760"]]
UPDATE "visitors" SET "counter" = $1, "updated_at" = $2 WHERE "visitors"."id" = $3  [["counter", 1], ["updated_at", "2023-05-02 16:18:02.003465"], ["id", 1]]

  def create
    @long_to_short_url = LongToShortUrl.new(long_to_short_url_params)

    if @long_to_short_url.save
---
INSERT INTO "long_to_short_urls" ("original_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["original_url", "https://guides.rubyonrails.org/getting_started.html"], ["created_at", "2023-05-02 16:13:57.230076"], ["updated_at", "2023-05-02 16:13:57.230076"]]

  def info
    @long_to_short_url = LongToShortUrl.find(params[:id])
    @visitor = @long_to_short_url.visitors.all
---
SELECT "long_to_short_urls".* FROM "long_to_short_urls" WHERE "long_to_short_urls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "visitors".* FROM "visitors" WHERE "visitors"."long_to_short_url_id" = $1  [["long_to_short_url_id", 1]]