app/models/long_to_short_url.rb

SELECT 1 AS one FROM "long_to_short_urls" WHERE "long_to_short_urls"."short_url" = $1 LIMIT $2  [["short_url", "bf4d9c7"], ["LIMIT", 1]]
---
  def generate_short_url
    url_hash = Digest::SHA256.hexdigest(self.original_url)
    self.short_url = url_hash[0..6] # shorten to 7 characters
    while LongToShortUrl.exists?(short_url: self.short_url)